"use strict";
Object.defineProperty(exports, "__esModule", { value: true });
exports.relationshipSensitivityQu = void 0;
exports.relationshipSensitivityQu = [
    {
        id: 1,
        question: 'Чи трапляється, що ваш партнер контролює, з ким ви спілкуєтеся або змушує пояснювати, де ви були?',
    },
    {
        id: 2,
        question: 'Чи буває так, що ви уникаєте розповідати партнерові про свої рішення, хобі або нові знайомства, побоюючись його/її реакції?',
    },
    {
        id: 3,
        question: 'Чи наполягає партнер на спільних рішеннях, навіть якщо це стосується особисто вас (одяг, зовнішність, робота тощо)?',
    },
    {
        id: 4,
        question: "Чи часто партнер знецінює ваші почуття, говорячи щось на кшталт: 'Ти перебільшуєш', 'Це не така велика проблема', 'Не вигадуй'?",
    },
    {
        id: 5,
        question: 'Чи трапляється, що після конфлікту ви відчуваєте, що саме ви винні, хоча початково це не так?',
    },
    {
        id: 6,
        question: 'Чи погрожує вам партнер розривом стосунків або покаранням за певні дії чи слова?',
    },
    {
        id: 7,
        question: 'Чи доводиться вам змінювати свої плани або принципи, щоб уникнути агресії чи незадоволення партнера?',
    },
    {
        id: 8,
        question: 'Чи використовує ваш партнер мовчання, ігнорування або дистанціювання як метод впливу на вас?',
    },
    {
        id: 9,
        question: 'Чи натякає партнер, що ви винні в його/її поганому настрої або каже, що через вас у нього/неї проблеми?',
    },
    {
        id: 10,
        question: 'Чи проявляє ваш партнер неконтрольовані ревнощі, безпідставно звинувачуючи вас у зраді або приховуванні чогось?',
    },
    {
        id: 11,
        question: 'Чи буває так, що партнер кричить на вас, використовує образливі слова або висміює вас (навіть жартома) у присутності інших?',
    },
    {
        id: 12,
        question: 'Чи доводилося вам боятися партнера через його/її гнів, навіть якщо це не супроводжувалося фізичним насильством?',
    },
    {
        id: 13,
        question: 'Чи буває так, що партнер наполягає на контролі ваших фінансів (наприклад, обмежує витрати, забороняє працювати або вимагає звітності про ваші покупки)?',
    },
    {
        id: 14,
        question: 'Чи бували ситуації, коли партнер силою втручався у ваші дії (наприклад, хапав за руку, блокував вихід з кімнати або штовхав під час сварки)?',
    },
    {
        id: 15,
        question: 'Чи бували моменти, коли партнер говорив щось агресивне на вашу адресу (наприклад, погрожував фізичною шкодою або лякав вас своєю поведінкою)?',
    },
];
