import { TestName } from '../../app/shared/models/common-tests';

export const QuestionsPageContent: Record<
  TestName,
  {
    testsInstruction: { instructionsTitle: string; steps: string[] };
    testTitleText: string;
    testSubtitleText: string;
    testInstruction?: {
      instructionsTitle: string;
      steps: string[];
    };
  }
> = Object.freeze({
  'role-in-relationships': {
    testsInstruction: {
      instructionsTitle:
        'Дотримуйтесь наступних кроків, щоб отримати максимальний результат:',
      steps: [
        'Попереду крутезний тест. Будьте щирими',
        'Ви дізнаєтесь вашу психологічну стратегію кохання.',
        'Після результатів не зволікайте — запишіться на безкоштовну консультацію. Дізнайтесь, як вам будувати стосунки.',
      ],
    },
    testTitleText: 'Ти — опора, натхнення чи дзеркало для партнера?',
    testSubtitleText:
      'Цей тест покаже, як ти поводишся у близьких зв’язках і що несеш у життя іншої людини. Це дає глибоке усвідомлення себе у парі.',
    seo: {
      title: 'Тест: Яка твоя роль у стосунках? - Дай відповідь на питання',
      metaTags: [
        'Дізнайся більше про тест "Яка твоя роль у стосунках?", щоб краще зрозуміти свої сильні сторони, стиль спілкування та природні схильності.',
        'тест про стосунки, роль у стосунках, психологічний тест, самопізнання, взаємини, MBTI',
      ],
    },
  },
  'you-coffee': {
    testsInstruction: {
      instructionsTitle:
        'Дотримуйтесь наступних кроків, щоб отримати максимальний результат:',
      steps: [
        'Дайте чесні відповіді на всі питання',
        'Прочитайте унікальні результати, які розкривають потаємну частину вашої підсвідомості',
        'Після результатів не зволікайте — запишіться на безкоштовну 60-хвилинну консультацію. Отримайте цілісне та унікальне розуміння себе',
      ],
    },

    testTitleText:
      'Твій смак особистості — як кава: глибокий, іноді з гірчинкою, але завжди унікальний.',
    testSubtitleText:
      'Відповідай на 11 простих, але смачних запитань — і дізнайся, яка кава ти всередині. Міцна? Кисленька? Чи, може, рідкісний сорт із власною легендою?',
    seo: {
      title: 'Запитання | Яка ти кава | vidchuttia',
      metaTags: [
        'Відповідай на запитання тесту Яка ти кава, щоб дізнатися свій унікальний тип.',
        'тест, Яка ти кава, запитання, психологія, саморозвиток',
      ],
    },
  },
  '16-personalities': {
    testsInstruction: {
      instructionsTitle:
        'Дотримуйтесь наступних кроків, щоб отримати максимальний результат:',
      steps: [
        'Дайте чесні відповіді на всі питання',
        'Прочитайте унікальні результати, які розкривають потаємну частину вашої підсвідомості',
        'Після результатів не зволікайте — запишіться на безкоштовну 60-хвилинну консультацію. Отримайте цілісне та унікальне розуміння себе',
      ],
    },
    testTitleText: 'Пройшовши цей тест, ти відкриєш основу своєї особистості.',
    testSubtitleText:
      'Ці знання залишаться з тобою, навіть якщо ти вирішиш не записуватись на консультацію.',
    seo: {
      title: 'Запитання | 16 типів особистості | vidchuttia',
      metaTags: [
        'Відповідай на запитання тесту 16 типів особистості, щоб дізнатися свій унікальний тип.',
        'тест, 16 типів особистості, MBTI, запитання, психологія, саморозвиток',
      ],
    },
  },
  attractiveness: {
    testsInstruction: {
      instructionsTitle:
        'Дотримуйтесь наступних кроків, щоб отримати максимальний результат:',
      steps: [
        'Відповідайте щиро — саме так ви отримаєте найточніші результати',
        'Дізнайтесь тонкощі вашої привабливості і їх вплив на інших ',
        'Після результатів не зволікайте — запишіться на безкоштовну консультацію. Дізнайтесь, як стати максимлаьно привабливим у своєму типі',
      ],
    },
    testTitleText:
      'Зрозумій, що саме в тобі найбільше притягує людей — емоційність, впевненість чи глибина?',
    testSubtitleText:
      'Цей тест допоможе побачити свої неочевидні сильні сторони в любові та дружбі. Те, що інші помічають, а ти — можливо, ні.',
    seo: {
      title: 'Запитання тесту на привабливість',
      metaTags: [
        'Відповідай на запитання тесту на привабливість, щоб дізнатися, як тебе сприймають інші. Оціни свою харизму, впевненість і чарівність!',
        'тест, привабливість, оцінка привабливості, зовнішність, харизма, впевненість, чарівність, психологічний тест, самопізнання',
      ],
    },
  },

  'toxical-relationship': {
    testsInstruction: {
      instructionsTitle:
        'Дотримуйтесь наступних кроків, щоб отримати максимальний результат:',
      steps: [
        'Будьте собою відповідаючи на запитання, обирайте щирі відповіді, а не ті, які б хотілось.',
        'Дізнайтесь переваги ваших стосунків та можливі небезпечні сигнали.',
        'Після результатів натисніть на кнопку Записатися на безкоштовну консультацію. Ви дізнаєтесь більше про ваш звʼязок та усі його особливості.',
      ],
    },
    testTitleText:
      'Чи не виснажують тебе стосунки? А може, щось давно сигналить про проблему?',
    testSubtitleText:
      'Цей тест допоможе побачити сигнали токсичності, які легко ігнорувати. І дасть перший поштовх до чесного діалогу з собою.',
    seo: {
      title:
        'Запитання до тесту на токсичні відносини з партнером | Оціні свої стосунки',

      metaTags: [
        'Пройди тест на токсичні відносини з партнером, відповідаючи на запитання, які допоможуть оцінити рівень маніпуляцій та аб’юзу у твоїх стосунках.',
        'тест, запитання до тесту, токсичні відносини, партнер, стосунки, маніпуляції, аб’юз, психологія',
      ],
    },
  },
  'traumatic-sensitivity': {
    testsInstruction: {
      instructionsTitle:
        'Дотримуйтесь наступних кроків, щоб отримати максимальний результат:',
      steps: [
        'Надайте чесні відповіді на життєві запитання.',
        'Дізнайтесь наскільки минулі ситуації впливають на ваше теперішнє життя.',
        'Потім натискайте Записатися на безкоштовну консультацію. Ви дізнаєтесь, як зробити ваше життя більш щасливим.',
      ],
    },
    testTitleText:
      'Як ти реагуєш на критику, непорозуміння чи образливі слова?',
    testSubtitleText:
      'Цей тест допоможе виявити свої вразливі місця — і зрозуміти, чи не живеш ти в режимі захисту. Це важливо, щоб побудувати здорові межі та зцілити себе.',
    seo: {
      title: 'Запитання тесту на травматичну чутливість',
      metaTags: [
        'Відповідай на запитання тесту на травматичну чутливість, щоб краще зрозуміти свої реакції на стрес та рівень емоційної вразливості.',
        'тест, травматична чутливість, психологічний тест, емоційна вразливість, запитання, психіка, самопізнання',
      ],
    },
  },
});
