import { TestName } from '../../app/shared/models/common-tests';

export const questionsInstructions: Record<
  TestName,
  { instructionsTitle: string; steps: string[] }
> = Object.freeze({
  'role-in-relationships': {
    instructionsTitle:
      'Дотримуйтесь наступних кроків, щоб отримати максимальний результат:',
    steps: [
      'Попереду крутезний тест. Будьте щирими',
      'Ви дізнаєтесь вашу психологічну стратегію кохання.',
      'Після результатів не зволікайте — запишіться на безкоштовну консультацію. Дізнайтесь, як вам будувати стосунки.',
    ],
  },
  'you-coffee': {
    instructionsTitle:
      'Дотримуйтесь наступних кроків, щоб отримати максимальний результат:',
    steps: [
      'Дайте чесні відповіді на всі питання',
      'Прочитайте унікальні результати, які розкривають потаємну частину вашої підсвідомості',
      'Після результатів не зволікайте — запишіться на безкоштовну 60-хвилинну консультацію. Отримайте цілісне та унікальне розуміння себе',
    ],
  },
  '16-personalities': {
    instructionsTitle:
      'Дотримуйтесь наступних кроків, щоб отримати максимальний результат:',
    steps: [
      'Дайте чесні відповіді на всі питання',
      'Прочитайте унікальні результати, які розкривають потаємну частину вашої підсвідомості',
      'Після результатів не зволікайте — запишіться на безкоштовну 60-хвилинну консультацію. Отримайте цілісне та унікальне розуміння себе',
    ],
  },
  attractiveness: {
    instructionsTitle:
      'Дотримуйтесь наступних кроків, щоб отримати максимальний результат:',
    steps: [
      'Відповідайте щиро — саме так ви отримаєте найточніші результати',
      'Дізнайтесь тонкощі вашої привабливості і їх вплив на інших ',
      'Після результатів не зволікайте — запишіться на безкоштовну консультацію. Дізнайтесь, як стати максимлаьно привабливим у своєму типі',
    ],
  },

  'toxical-relationship': {
    instructionsTitle:
      'Дотримуйтесь наступних кроків, щоб отримати максимальний результат:',
    steps: [
      'Будьте собою відповідаючи на запитання, обирайте щирі відповіді, а не ті, які б хотілось.',
      'Дізнайтесь переваги ваших стосунків та можливі небезпечні сигнали.',
      'Після результатів натисніть на кнопку Записатися на безкоштовну консультацію. Ви дізнаєтесь більше про ваш звʼязок та усі його особливості.',
    ],
  },
  'traumatic-sensitivity': {
    instructionsTitle:
      'Дотримуйтесь наступних кроків, щоб отримати максимальний результат:',
    steps: [
      'Надайте чесні відповіді на життєві запитання.',
      'Дізнайтесь наскільки минулі ситуації впливають на ваше теперішнє життя.',
      'Потім натискайте Записатися на безкоштовну консультацію. Ви дізнаєтесь, як зробити ваше життя більш щасливим.',
    ],
  },
});
