export const consultationCards: {
  title: string;
  list: {
    titleList: string;
    listCards: string[];
  };
  unfit: string;
}[] = [
  {
    title: 'Коли не знаєш, на що спертись — спирайся на себе',
    list: {
      titleList: 'Цей пакет для тебе, якщо ти хочеш:',
      listCards: [
        'Зрозуміти, в чому твоя внутрішня сила — не загалом, а саме твоя.',
        'Побачити, де твої думки працюють проти тебе — і як це змінити.',
        'Усвідомити, що тебе наповнює, а що виснажує — і як повертати собі себе.',
      ],
    },
    unfit: 'Ти шукаєш тільки того, що вже знаєш, і не готовий відкривати.',
  },
  {
    title: 'А якщо я не там, де мені бути?',
    list: {
      titleList: 'Цей пакет для тебе, якщо ти хочеш:',
      listCards: [
        'Побачити можливості, які дійсно твої',
        'Відкрити свої сильні сторони як особистості, а не тільки професійні навички',
        'Дізнатись, де ти зможеш реалізувати свій талант',
      ],
    },
    unfit: 'Ти чекаєш список професій, а не глибинне розуміння свого таланту.',
  },
  {
    title: 'Чому ми або злітаємо — або вибухаємо?',
    list: {
      titleList: 'Цей пакет для тебе, якщо ти хочеш:',
      listCards: [
        'Зрозуміти, від чого саме залежить ваш зв’язок — що його підсилює, а що руйнує',
        'Побачити глибинні розбіжності мислення, які створюють напругу',
        'Побудувати свою стратегію гармонії, спираючись на природу власного мислення',
      ],
    },
    unfit:
      'Ти шукаєш підтвердження, що проблема в партнері, а не готовий до глибшого розуміння, як будувати справжній контакт.',
  },
];
