export const consultationCards: {
  title: string;
  list: {
    titleList: string;
    listCards: string[];
  };
}[] = [
  {
    title: 'Коли не знаєш, на що спертись — спирайся на себе',
    list: {
      titleList: 'Цей пакет для тебе, якщо ти хочеш:',
      listCards: [
        'Зрозуміти, в чому твоя внутрішня сила — не загалом, а саме твоя.',
        'Розібратись, на що спиратись у виборі — логіку чи почуття.',
        'Побачити, де твої думки працюють проти тебе — і як це змінити.',
        'Усвідомити, що тебе наповнює, а що виснажує — і як повертати собі себе.',
      ],
    },
  },
  {
    title: 'А якщо я не там, де мені бути?',
    list: {
      titleList: 'Цей пакет для тебе, якщо ти хочеш:',
      listCards: [
        'Зрозуміти, чому робота не викликає відчуття “мій шлях”',
        'Побачити можливості, які дійсно твої',
        'Відкрити свої сильні сторони як особистості, а не тільки професійні навички',
        'Дізнатись, де ти зможеш реалізувати свій талант',
      ],
    },
  },
  {
    title: 'Чому ми або злітаємо — або вибухаємо?',
    list: {
      titleList: 'Цей пакет для тебе, якщо ти хочеш:',
      listCards: [
        'Зрозуміти, від чого саме залежить ваш зв’язок — що його підсилює, а що руйнує',
        'Побачити глибинні розбіжності мислення, які створюють напругу',
        'Навчитись не втрачати свою глибину, розкривати себе в парі — але не через конфлікт',
        'Побудувати свою стратегію гармонії, спираючись на природу власного мислення та глибинну мову партнера',
      ],
    },
  },
];
