const testInfo = {
  title: 'Що робить тебе по-справжньому привабливим?',
  description: `Ти можеш роками шукати відповідь у книгах, психології чи відгуках інших людей. 
  Але правда в тому, що кожен має свій унікальний тип привабливості, який не схожий на інші. 
  І часто те, що робить тебе особливим, ти просто не помічаєш або навіть намагаєшся виправити.

  Цей тест створений не для того, щоб поставити тебе в рамки, а навпаки — 
  щоб показати твою природну силу, яка вже в тобі є.`,
  benefits: [
    'Що робить тебе цікавим і магнетичним для інших.',
    'Як ти привертаєш людей несвідомо — навіть не помічаючи цього.',
    'Які твої сильні сторони, які ти недооцінюєш.',
    'Що може блокувати твою природну привабливість і як це змінити.',
  ],
  conclusion: `Цей тест — не про те, як “стати кращим”, а про те, 
  як зрозуміти себе глибше і перестати робити зайві зусилля там, де вони не потрібні.`,
  callToAction: '❤️ Пройди тест і дізнайся, в чому твоя справжня сила.',
  routeUrl: '/tests/attractiveness/questions',
};

export default testInfo;
