import { ConsultationContent } from '../../shared/types/consultations';

export const consultationData: ConsultationContent = {
  title:
    'Замість років пошуків — цілісне розуміння себе вже на першій зустрічі.',
  subtitle:
    'У тебе є талант – унікальний, тільки твій. Коли ти займаєш свою природну «посадку» – місце, де твій розум, відчуття та дії працюють у гармонії – життя набуває сенсу, і ти нарешті відчуваєш себе собою.',
  descriptions:
    'Це не про досягнення чи зовнішні атрибути щастя. Це про усвідомлення своєї сутності.',
  results: {
    title: 'Що зміниться у вашому житті?',
    resultsDescription: ' ',
    items: [
      {
        heading: '✅ Глибоке розуміння себе:',
        description:
          'Ви дізнаєтеся свій унікальний когнітивний профіль: свої сильні сторони, приховані мотиви та потреби. Це усвідомлення допоможе побачити себе з нового ракурсу. Ви зрозумієте, чому деякі рішення вас виснажують чи чому конфлікти у стосунках повторюються, як інші бачать вас.',
      },
      {
        heading: '✅ Прийняття власної особистості:',
        description:
          'Ви побачите себе з нового боку, зрозумієте причини самокритики та отримаєте напрямок, як рухатися до більшої гармонії із собою. Це допоможе зробити перший крок до внутрішнього спокою та впевненості.',
      },
      {
        heading: '✅ Заповнення внутрішньої пустоти:',
        description:
          'Знайшовши своє справжнє "я" і визначивши життєві орієнтири, Ви перестанете відчувати ту саму порожнечу. Натомість з’явиться відчуття смислу, цілісності.',
      },
      {
        heading: '✅ Поліпшення стосунків:',
        description:
          ' Ви зможете краще зрозуміти себе та свого партнера, побачити, як ваші особливості впливають на взаємодію. Це допоможе глибше відчувати один одного, зміцнити взаємоповагу та покращити спілкування.',
      },
      {
        heading: '✅ Чіткий план розвитку:',
        description:
          'Ви отримаєте конкретні рекомендації та зрозумієте свої сильні сторони, потенціал і напрямки росту. Це допоможе робити усвідомлені вибори в стосунках, кар’єрі та особистісному розвитку.',
      },
    ],
  },
  consultationProcess: {
    title: 'Як проходить консультація?',
    descriptions: ' ',
    steps: [
      {
        stepTitle: '✔ Перший крок:',
        description:
          'Ви просто залишаєте заявку чи пишете мені. Обираємо зручний час і формат: онлайн або в Києві.',
      },
      {
        stepTitle: '✔ Про що поговоримо?',
        description:
          'Ми визначимо, про що будемо говорити: стосунки, кар’єра, саморозвиток чи щось інше.',
      },
      {
        stepTitle: '✔ Ваші когнітивні таланти :',
        description:
          'Ми детально розберемо, як саме ви мислите та приймаєте рішення. Що для вас природно, а що може бути нав’язаним чи чужим. Це допоможе краще зрозуміти, чому в деяких сферах ви почуваєтеся впевнено, а в інших – ні.',
      },
      {
        stepTitle: '✔ Глибоке розуміння та чіткість:',
        description:
          'Я допоможу розкласти все по полицях, щоб ви побачили цілісну картину: які закономірності у вашому житті, що повторюється, що можна змінити і як це зробити.',
      },
      {
        stepTitle: '✔ Чіткий напрямок руху:',
        description:
          'У вас буде не просто нове розуміння себе, а й конкретні кроки, які можна одразу застосувати.',
      },
    ],
    sessionDuration:
      '⏳ Тривалість – 60 хвилин, але якщо знадобиться більше часу, завжди можна трохи затриматися. Головне – щоб усе стало на свої місця.',
    confidentiality: 'Все, про що ми говоримо, залишається між нами.',
    summaryText:
      'Ця консультація – про вас, вашу природу та можливості, які відкриваються, коли ви починаєте краще розуміти себе.',
  },
  uniqueApproach: {
    title: 'Чому це працює?',
    description:
      'Ми пробуємо різні ролі, адаптуємося, вчимося на власних помилках. Іноді здається, що ми майже дійшли до суті, але щось все ще залишається незрозумілим.',
    extraDescription:
      'Ці пошуки можуть тривати все життя. Багато людей приходять до справжнього розуміння себе лише після десятків років проб і болю, коли через досвід відсіюють усе зайве. Але вся інструкція до себе завжди була поруч. Вона не складна – просто її ніколи не пояснювали так, щоб вона дійсно відкрила тобі очі.',
    elseDescription: 'Я допомагаю побачити цю цілісну картину вже зараз.',
    options: [
      '✅ Аналіз когнітивних функцій розкриває глибокі закономірності твоєї свідомості – як ти сприймаєш світ, чому саме так приймаєш рішення, що тобі природно, а що нав’язане суспільством.',
      '✅ Глибинне розпізнавання особистості дозволяє відокремити твою справжню природу від зовнішніх впливів і відчути, ким ти є поза рамками чужих очікувань.',
      '✅ Розуміння своїх внутрішніх імпульсів допомагає відповісти на питання, які ти, можливо, навіть не наважувався ставити собі раніше.',
    ],
    optionsDescription:
      'Я не просто аналізую особистісні типи – я допомагаю зрозуміти себе глибше та простіше. Як ENFP, я природно бачу закономірності у мисленні, почуттях і виборах. Помічаю ваші сильні сторони, навіть якщо ви їх ще не усвідомлюєте, розплутую внутрішні суперечності та допомагаю знайти шлях, що відгукнеться саме вам. Без осуду, без складних термінів – лише, ясність, підтримка і новий погляд на себе.',
  },
  signUp: {
    title: 'Запишіться на консультацію',
    description:
      'Не відкладайте себе на потім – запишіться сьогодні, і вже за тиждень ви побачите перші зміни.',
    extraTitle: 'Як записатися?',
    instructions: [
      '✅ Заповніть форму нижче або напишіть мені в месенджер (посилання).',
      '✅ Я зв’яжусь із вами для узгодження часу консультації.',
      '✅ Ви отримуєте деталі зустрічі та рекомендації перед консультацією.',
    ],
  },
  successMessage: '✅ Ви успішно записалися!',
};
