export const consultationData = {
  myHelp: {
    sectionTitle: 'Я допоможу тобі розібратися:',
    listItems: [
      {
        itemTitle: 'Глибоке розуміння себе:',
        subtitle:
          'Ви дізнаєтеся свій унікальний когнітивний профіль: свої сильні сторони, приховані мотиви та потреби. Це усвідомлення допоможе побачити себе з нового ракурсу. Ви зрозумієте, чому деякі рішення вас виснажують чи чому конфлікти у стосунках повторюються, як інші бачать вас.',
      },
      {
        itemTitle: 'Прийняття власної особистості:',
        subtitle:
          'Ви побачите себе з нового боку, зрозумієте причини самокритики та отримаєте напрямок, як рухатися до більшої гармонії із собою. Це допоможе зробити перший крок до внутрішнього спокою та впевненості.',
      },
      {
        itemTitle: 'Заповнення внутрішньої пустоти:',
        subtitle:
          'Знайшовши своє справжнє "я" і визначивши життєві орієнтири, Ви перестанете відчувати ту саму порожнечу. Натомість з’явиться відчуття смислу, цілісності.',
      },
      {
        itemTitle: 'Поліпшення стосунків:',
        subtitle:
          'Ви зможете краще зрозуміти себе та свого партнера, побачити, як ваші особливості впливають на взаємодію. Це допоможе глибше відчувати один одного, зміцнити взаємоповагу та покращити спілкування.',
      },
      {
        itemTitle: 'Чіткий план розвитку:',
        subtitle:
          'Ви отримаєте конкретні рекомендації та зрозумієте свої сильні сторони, потенціал і напрямки росту. Це допоможе робити усвідомлені вибори в стосунках, кар’єрі та особистісному розвитку.',
      },
    ],
  },
  aboutConsultation: {
    sectionTitle: 'Як проходить консультація?',
    listItems: [
      {
        itemTitle: 'Перший крок:',
        subtitle:
          'Ви просто залишаєте заявку чи пишете мені. Обираємо зручний час і формат: онлайн або в Києві.',
      },
      {
        itemTitle: 'Про що поговоримо?',
        subtitle:
          'Ми визначимо, про що будемо говорити: стосунки, кар’єра, саморозвиток чи щось інше.',
      },
      {
        itemTitle: 'Ваші когнітивні таланти:',
        subtitle:
          'Ми детально розберемо, як саме ви мислите та приймаєте рішення. Що для вас природно, а що може бути нав’язаним чи чужим. Це допоможе краще зрозуміти, чому в деяких сферах ви почуваєтеся впевнено, а в інших – ні.',
      },
      {
        itemTitle: 'Глибоке розуміння та чіткість:',
        subtitle:
          'Я допоможу розкласти все по полицях, щоб ви побачили цілісну картину: які закономірності у вашому житті, що повторюється, що можна змінити і як це зробити.',
      },
      {
        itemTitle: 'Чіткий напрямок руху:',
        subtitle:
          'У вас буде не просто нове розуміння себе, а й конкретні кроки, які можна одразу застосувати.',
      },
      {
        itemTitle: 'Конфіденційність:',
        subtitle: 'Все, про що ми говоримо, залишається між нами.',
      },
      {
        itemTitle: 'Тривалість консультації:',
        subtitle:
          'Тривалість – 60 хвилин, але якщо знадобиться більше часу, завжди можна трохи затриматися. Головне – щоб усе стало на свої місця.',
      },
      {
        itemTitle: 'Ця консультація',
        subtitle:
          'про вас, вашу природу та можливості, які відкриваються, коли ви починаєте краще розуміти себе.',
      },
    ],
  },
  itWorksCards: [
    {
      title: 'Аналіз когнітивних функцій',
      subtitle:
        'розкриває глибокі закономірності твоєї свідомості – як ти сприймаєш світ, чому саме так приймаєш рішення, що тобі природно, а що нав’язане суспільством.',
      svgPath: '/assets/new/core/consultation/card-svg-1.svg',
    },
    {
      title: 'Глибинне розпізнавання особистості',
      subtitle:
        'дозволяє відокремити твою справжню природу від зовнішніх впливів і відчути, ким ти є поза рамками чужих очікувань.',
      svgPath: '/assets/new/core/consultation/card-svg-2.svg',
    },
    {
      title: 'Розуміння своїх внутрішніх імпульсів',
      subtitle:
        'допомагає відповісти на питання, які ти, можливо, навіть не наважувався ставити собі раніше.',
      svgPath: '/assets/new/core/consultation/card-svg-3.svg',
    },
  ],
};
