{
  "title": "Ти хочеш нарешті перестати сумніватись у собі й зрозуміти, хто ти насправді?",
  "description": "Твій тип особистості — це лише верхівка айсберга. Але під нею прихована твоя справжня історія: внутрішні конфлікти, сумніви, незрозумілі відчуття та моменти, коли здається, що ти не вписуєшся в рамки світу навколо.",
  "targetAudience": [
    "з дитинства бачив світ інакше, глибше, по-своєму — і часто почувався через це трохи віддаленим, ніби ти «не з цієї системи»",
    "не раз помічав, як приймаєш рішення, які ніби правильні — логічні, очікувані, звичні — але всередині відгуку немає… шукаєш своє",
    "іноді з’являється тихе, але вперте відчуття: «я можу більше…»"
  ],
  "benefits": [
    {
      "title": "Твій справжній талант",
      "description": "ти нарешті зрозумієш, у чому твоя головна сила, чому саме в цьому твоя унікальність, як саме ця сила може змінити твоє життя."
    },
    {
      "title": "Чітке розуміння себе",
      "description": "ти побачиш, чому в тобі виникають внутрішні конфлікти, звідки беруться сумніви й суперечливі рішення, і як не плутатися в собі."
    },
    {
      "title": "Ключі від стресу",
      "description": "ти зрозумієш, чому певні ситуації вибивають саме тебе, як твоє мислення заводить тебе в стрес, і отримаєш особистий, зрозумілий спосіб швидко повертати собі спокій та рівновагу."
    },
    {
      "title": "Внутрішню силу твого мислення",
      "description": "ти зрозумієш свій особистий, природний алгоритм прийняття рішень, який допомагатиме тобі робити вибір без постійних внутрішніх суперечностей, відчувати впевненість і внутрішній комфорт."
    }
  ],
  "testimonial": {
    "quote": "Тепер я розумію, хто я, чому мені було важко — і що мені з цим робити далі.",
    "numberOfPeople": 100,
    "description": "Понад 100 людей, які були на твоєму місці, уже зробили цей крок. Люди приходять із внутрішньою плутаниною, відчуттям «не свого життя» або постійними сумнівами."
  },
  "note": "Увага: через глибокий формат консультації кількість місць щомісяця обмежена."
}
