"use strict";
Object.defineProperty(exports, "__esModule", { value: true });
exports.attractiveness = void 0;
exports.attractiveness = [
    {
        id: 1,
        question: 'Що люди зазвичай кажуть про тебе після знайомства?',
        answers: [
            {
                text: 'Ти дуже впевнений(а) у собі, це притягує!',
                type: '🔥 Харизматична',
            },
            { text: 'Ти загадка, хочеться дізнатися більше!', type: '🖤 Загадкова' },
            {
                text: 'З тобою цікаво говорити, ти розумний(а)!',
                type: '🧠 Інтелектуальна',
            },
            { text: 'Ти випромінюєш тепло, з тобою спокійно!', type: '🤍 Тепла' },
            { text: 'Ти заряджаєш своєю енергією!', type: '⚡ Дика' },
            { text: 'Ти дуже милий(а) і ніжний(а)!', type: '💫 Ніжна' },
        ],
    },
    {
        id: 2,
        question: 'Що найбільше привертає увагу до тебе?',
        answers: [
            {
                text: 'Моя впевненість у собі, це відчувається.',
                type: '🔥 Харизматична',
            },
            {
                text: 'Моя загадковість, мене хочеться розгадати.',
                type: '🖤 Загадкова',
            },
            { text: 'Мій розум і цікаві розмови.', type: '🧠 Інтелектуальна' },
            { text: 'Моє тепло, з тобою добре.', type: '🤍 Тепла' },
            { text: 'Моя енергія, я заряджаю людей!', type: '⚡ Дика' },
            { text: 'Моя ніжність і щирість.', type: '💫 Ніжна' },
        ],
    },
    {
        id: 3,
        question: 'Яке місце тобі найближче за відчуттями?',
        answers: [
            {
                text: 'Осяяна сцена, де всі погляди звернені на тебе.',
                type: '🔥 Харизматична',
            },
            {
                text: 'Старовинна бібліотека з книгами, що приховують таємниці.',
                type: '🖤 Загадкова',
            },
            {
                text: 'Затишна кав’ярня, де можна годинами говорити про сенс життя.',
                type: '🧠 Інтелектуальна',
            },
            {
                text: 'Будинок друзів, де тебе зустрічають теплим обіймом.',
                type: '🤍 Тепла',
            },
            {
                text: 'Шалена подорож у невідоме, коли вітер розвиває волосся.',
                type: '⚡ Дика',
            },
            {
                text: "М'який плед, приглушене світло й відчуття спокою.",
                type: '💫 Ніжна',
            },
        ],
    },
    {
        id: 4,
        question: 'Як ти зазвичай привертаєш увагу?',
        answers: [
            {
                text: 'Просто заходжу – і всі мене помічають',
                type: '🔥 Харизматична',
            },
            {
                text: ' Моя загадковість змушує людей цікавитися мною',
                type: '🖤 Загадкова',
            },
            {
                text: 'Люди слухають мене, бо я цікаво говорю',
                type: '🧠 Інтелектуальна',
            },
            {
                text: 'Я випромінюю тепло, тому люди тягнуться до мене',
                type: '🤍 Тепла',
            },
            { text: 'Я дію несподівано, і це зачаровує', type: '⚡ Дика' },
            {
                text: 'Моє спокійне і ніжне ставлення викликає симпатію ',
                type: '💫 Ніжна',
            },
        ],
    },
    {
        id: 5,
        question: 'Як ти реагуєш на компліменти?',
        answers: [
            {
                text: ' Усміхаюсь і кажу: ‘Знаю, дякую!',
                type: '🔥 Харизматична',
            },
            {
                text: 'Посміхаюсь загадково, нічого не відповідаю.',
                type: '🖤 Загадкова',
            },
            { text: 'Щиро дякую і радію!', type: '🧠 Інтелектуальна' },
            { text: 'Моє тепло, з тобою добре.', type: '🤍 Тепла' },
            { text: 'Жартую або кокетую у відповідь.', type: '⚡ Дика' },
            { text: 'Трохи червонію, але це приємно.', type: '💫 Ніжна' },
        ],
    },
    {
        id: 6,
        question: 'Як ти фліртуєш?',
        answers: [
            {
                text: 'Дивлюсь прямо в очі й впевнено посміхаюсь.',
                type: '🔥 Харизматична',
            },
            {
                text: 'Граю в загадковість, щоб хотілося мене розгадати.',
                type: '🖤 Загадкова',
            },
            {
                text: 'Захоплюю розмовою так, що неможливо відірватися.',
                type: '🧠 Інтелектуальна',
            },
            {
                text: 'Буду уважним(ою) і дам відчути, що мені справді цікаво.',
                type: '🤍 Тепла',
            },
            {
                text: 'Роблю щось несподіване, щоб змусити сміятися. ',
                type: '⚡ Дика',
            },
            {
                text: 'Червонію, відводжу погляд, але ніжно посміхаюсь.',
                type: '💫 Ніжна',
            },
        ],
    },
    {
        id: 7,
        question: 'Що ти робиш, коли заходиш у кімнату, повну людей?',
        answers: [
            {
                text: 'Одразу відчуваю себе головним(ою), і це помічають всі.',
                type: '🔥 Харизматична',
            },
            {
                text: 'Залишаюся осторонь, але люди все одно звертають увагу. ',
                type: '🖤 Загадкова',
            },
            {
                text: 'Швидко знаходжу цікаву тему, і всі починають слухати.',
                type: '🧠 Інтелектуальна',
            },
            {
                text: 'Просто посміхаюсь і легко вливаюся в спілкування.',
                type: '🤍 Тепла',
            },
            {
                text: 'Кидаю жарт або роблю щось несподіване, щоб привернути увагу. ',
                type: '⚡ Дика',
            },
            { text: 'Спокійно спостерігаю і відчуваю атмосферу.', type: '💫 Ніжна' },
        ],
    },
    {
        id: 8,
        question: 'Який фільм або серіал тобі ближче?',
        answers: [
            {
                text: ' "Вовк з Волл-стріт" – яскравість, впевненість, магнетизм. ',
                type: '🔥 Харизматична',
            },
            {
                text: '"Шерлок" – загадковість, спостережливість, інтелект.',
                type: '🖤 Загадкова',
            },
            {
                text: ' "Інтерстеллар" – глибина, філософія, великі питання.',
                type: '🧠 Інтелектуальна',
            },
            {
                text: '"Друзі" – тепло, довіра, відчуття близькості.',
                type: '🤍 Тепла',
            },
            {
                text: ' "Джон Вік" – дія, енергія, вибуховий характер. ',
                type: '⚡ Дика',
            },
            { text: ' "Амелі" – ніжність, чарівність, легкість.', type: '💫 Ніжна' },
        ],
    },
    {
        id: 9,
        question: 'В який момент ти відчуваєш, що світ належить тобі?',
        answers: [
            {
                text: ' Коли я заходжу в кімнату і відчуваю, що всі мене помітили.',
                type: '🔥 Харизматична',
            },
            {
                text: ' Коли я ловлю на собі зацікавлені погляди, але ніхто не може мене "прочитати".',
                type: '🖤 Загадкова',
            },
            {
                text: ' Коли мої слова або ідеї змушують людей задуматися.',
                type: '🧠 Інтелектуальна',
            },
            {
                text: 'Коли я підтримую когось, і бачу, як змінюється їхній настрій.',
                type: '🤍 Тепла',
            },
            {
                text: 'Коли я приймаю ризиковане рішення і воно виявляється правильним! ',
                type: '⚡ Дика',
            },
            {
                text: 'Коли я відчуваю, що мене люблять по-справжньому.',
                type: '💫 Ніжна',
            },
        ],
    },
    {
        id: 10,
        question: 'Що тобі найбільше хочеться, але не завжди вистачає сміливості зробити?',
        answers: [
            {
                text: ' Взяти ситуацію під контроль і змусити всіх слухати мене. ',
                type: '🔥 Харизматична',
            },
            {
                text: 'Не пояснювати себе, а просто залишатися загадкою.',
                type: '🖤 Загадкова',
            },
            {
                text: 'Розкрити свої ідеї повністю, навіть якщо вони здаються дивними.',
                type: '🧠 Інтелектуальна',
            },
            {
                text: 'Стати для когось справжньою опорою, навіть якщо це важко. ',
                type: '🤍 Тепла',
            },
            {
                text: 'Ризикнути всім і зробити щось абсолютно божевільне.',
                type: '⚡ Дика',
            },
            {
                text: ' Відкритися перед кимось повністю, не боячись бути вразливим(ою).',
                type: '💫 Ніжна',
            },
        ],
    },
];
