import { TestResults } from '../../shared/models/tests/common-tests';

export const testResultExample: Partial<TestResults> = {
  type: 'ENFJ',
  subtitle:
    ' Сила, яка обіймає. Людина, що вміє вести інших і турбуватись одночасно. Внутрішня теплота поєднана з харизмою.',
  sections: [
    {
      sectionsName:
        'Ти часто допомагаєш іншим — навіть тоді, коли ніхто не просить.',
      sectionsDescription:
        'Іноді здається, що світ навколо тримається на тобі. Та є одне важливе питання: а на чому тримаєшся ти?',
      sectionsList: [
        'Ти завжди поруч, коли потрібно — підтримуєш, надихаєш, виводиш людей з темряви. І мало хто бачить, коли твоя власна свічка догорає.',
        'Ти так добре відчуваєш інших, що легко забуваєш, чого хочеш сам.',
        'Іноді ти хочеш зникнути. Не тому, що слабкий — а тому, що ніколи не зупинявся.',
      ],
    },
    {
      sectionsName: '',
      sectionsDescription:
        'Можливо, зараз саме той момент, коли варто не давати, а дозволити собі взяти. Просто трохи тиші, розуміння і простір — у якому можна побути собою.',
      sectionsList: [
        'Ти звик бути сильним — навіть коли втомлений. Тримати себе зібрано — навіть коли всередині шторм.',
        'На консультації ти зможеш просто бути. Без ролей. Без тиску. Це не про зміни назавжди. Це про мить, у якій тебе нарешті побачать таким, яким ти є — глибоким, вразливим, справжнім.',
      ],
    },
    {
      sectionsName: 'Це не обов’язок. Це можливість бути з собою',
      sectionsDescription:
        'Можливо, зараз саме той момент, коли варто не давати, а дозволити собі взяти. Просто трохи тиші, розуміння і простір — у якому можна побути собою.',
      sectionsList: [
        'Ти згадаєш, що в тебе є бажання. І що вони важливі.',
        'Ти дозволиш собі трохи турботи — не як винагороду, а як природне право.',
        'Ти відчуєш опору. Не як тягар. А як теплу присутність поруч.',
      ],
    },
    {
      sectionsName: '',
      sectionsDescription:
        'Я багато разів чув одну й ту саму фразу від людей, схожих на тебе: «Я завжди для інших. А хто для мене?» І я створив цю консультацію саме для таких моментів.',
      sectionsList: [
        'Для підписників Instagram — тиха знижка 10%. Просто напиши мені «я тут» після заявки.',
      ],
    },
    {
      sectionsName: '',
      sectionsDescription:
        'Ти звик бути тим, хто тримає всіх. Але ніхто не тримає тебе силоміць. Ти можеш дозволити собі зупинку. І, можливо, саме в ній — твоя наступна сила.',
      sectionsList: ['Я тут, коли ти захочеш зробити цей крок.'],
    },
  ],
};
