"use strict";
Object.defineProperty(exports, "__esModule", { value: true });
exports.questionsPersonality = void 0;
exports.questionsPersonality = [
    {
        id: 1,
        question: 'Мені подобається детально розплановувати свій день, перш ніж щось робити.',
    },
    {
        id: 2,
        question: 'Я часто отримую енергію від спілкування з новими людьми.',
    },
    {
        id: 3,
        question: 'Я більше зосереджуюся на реальних фактах, ніж на абстрактних ідеях.',
    },
    {
        id: 4,
        question: 'Мені важливо враховувати почуття інших людей під час ухвалення рішень.',
    },
    {
        id: 5,
        question: 'Я надаю перевагу гнучким планам, які можна зміняти в процесі.',
    },
    {
        id: 6,
        question: 'У важливих ситуаціях я більше покладаюся на логіку, ніж на емоції.',
    },
    {
        id: 7,
        question: 'Я часто уявляю, як могли б розвиватися події, навіть якщо це не має практичного значення.',
    },
    {
        id: 8,
        question: 'Я швидше відпочиваю, коли проводжу час наодинці.',
    },
    {
        id: 9,
        question: 'Я люблю, коли завдання мають чіткі інструкції та передбачуваний результат.',
    },
    {
        id: 10,
        question: 'Я зазвичай аналізую ситуацію з усіх боків, перш ніж висловлювати свою думку.',
    },
    {
        id: 11,
        question: 'Мені комфортніше мати загальний план, але залишати місце для імпровізації.',
    },
    {
        id: 12,
        question: 'Мені цікавіше розбиратися в деталях, ніж у загальній картині.',
    },
    {
        id: 13,
        question: 'Я легко заводжу нові знайомства в будь-якому середовищі.',
    },
    {
        id: 14,
        question: 'Я відчуваю себе більш упевненим, коли є чіткий розклад на день.',
    },
    {
        id: 15,
        question: 'Я схильний звертати увагу на дрібниці, які інші можуть не помітити.',
    },
    {
        id: 16,
        question: 'У складних ситуаціях я завжди намагаюся залишатися максимально об’єктивним.',
    },
    {
        id: 17,
        question: 'Я часто змінюю свої плани в останній момент, якщо це здається доречним.',
    },
    {
        id: 18,
        question: 'Мене більше приваблюють ідеї про майбутнє, ніж робота із практичними фактами.',
    },
    {
        id: 19,
        question: 'Я можу довго спілкуватися з людьми і не відчувати втоми.',
    },
    {
        id: 20,
        question: 'Я люблю експериментувати та пробувати щось нове, навіть якщо це ризиковано.',
    },
    {
        id: 21,
        question: 'Я вважаю, що гармонія у стосунках важливіша за досягнення мети.',
    },
    {
        id: 22,
        question: 'Мені комфортніше працювати з відкритими дедлайнами, ніж із суворими строками.',
    },
    {
        id: 23,
        question: 'Я віддаю перевагу чітким структурам у роботі.',
    },
    {
        id: 24,
        question: 'Мені легко уявити, як щось виглядатиме через кілька років.',
    },
    {
        id: 25,
        question: 'Я відчуваю, що мені легше думати, коли я наодинці.',
    },
    {
        id: 26,
        question: 'Мені подобається аналізувати те, що я бачу, чую чи відчуваю, а не просто мріяти.',
    },
    {
        id: 27,
        question: 'Я часто використовую інтуїцію, щоб знайти вихід зі складних ситуацій.',
    },
    {
        id: 28,
        question: 'Я рідко сперечаюся, щоб не засмучувати інших людей.',
    },
    {
        id: 29,
        question: 'Я відчуваю дискомфорт, коли не знаю, що робити далі.',
    },
    {
        id: 30,
        question: 'Я більше орієнтуюсь на процес, ніж на кінцевий результат.',
    },
    {
        id: 31,
        question: 'Я відчуваю, що мої рішення часто ґрунтуються на емоціях.',
    },
    {
        id: 32,
        question: 'Я легко адаптуюся до нових обставин, навіть якщо вони неочікувані.',
    },
    {
        id: 33,
        question: 'Я віддаю перевагу структурованій роботі замість імпровізації.',
    },
    {
        id: 34,
        question: 'Мене більше цікавить, як речі працюють, ніж те, що вони означають.',
    },
    {
        id: 35,
        question: 'Я часто зосереджуюсь на можливостях, які ще не реалізовані.',
    },
    {
        id: 36,
        question: 'Я швидко втомлююся від тривалого спілкування з людьми.',
    },
    {
        id: 37,
        question: 'Я завжди відчуваю себе комфортніше, коли знаю, що на мене чекає попереду.',
    },
    {
        id: 38,
        question: 'Мені легко орієнтуватися на абстрактні ідеї та концепції.',
    },
    {
        id: 39,
        question: 'Я люблю спілкуватися з іншими і часто виступаю ініціатором розмови.',
    },
    {
        id: 40,
        question: 'Я часто приймаю рішення на основі логічного аналізу ситуації.',
    },
    {
        id: 41,
        question: 'Я люблю експериментувати, навіть якщо це створює додаткові ризики.',
    },
    {
        id: 42,
        question: 'Я зазвичай намагаюся уникати конфліктів заради гармонії у відносинах.',
    },
    {
        id: 43,
        question: 'Мені подобається розбирати складні ідеї, навіть якщо це потребує часу.',
    },
    {
        id: 44,
        question: 'Я завжди зберігаю спокій, коли потрібно швидко змінювати плани.',
    },
    {
        id: 45,
        question: 'Я надаю перевагу тому, щоб працювати за чітким графіком і дотримуватися його.',
    },
    {
        id: 46,
        question: 'Я часто мрію про майбутнє, навіть якщо це не має прямого зв’язку з реальністю.',
    },
    {
        id: 47,
        question: 'Я відчуваю себе спокійніше, коли можу працювати без постійного спілкування з людьми.',
    },
    {
        id: 48,
        question: 'Я люблю організовувати інформацію, щоб вона була чіткою та зрозумілою.',
    },
    {
        id: 49,
        question: 'Я часто звертаю увагу на те, як люди відчувають себе у певній ситуації.',
    },
    {
        id: 50,
        question: 'Я надаю перевагу роботі в групі, ніж працювати самостійно.',
    },
    {
        id: 51,
        question: 'Я легко знаходжу раціональні аргументи для ухвалення рішення.',
    },
    {
        id: 52,
        question: 'Я віддаю перевагу творчим підходам у вирішенні завдань, ніж стандартним методам.',
    },
    {
        id: 53,
        question: 'Я можу довго працювати, якщо знаю, що мета чітко визначена.',
    },
    {
        id: 54,
        question: 'Мені подобається відкривати нові ідеї та шукати нестандартні рішення.',
    },
    {
        id: 55,
        question: 'Я відчуваю себе комфортніше, коли є можливість слідувати встановленим правилам.',
    },
    {
        id: 56,
        question: 'Я можу швидко змінити свої плани, якщо обставини змінюються.',
    },
    {
        id: 57,
        question: 'Я намагаюся дотримуватись логіки, навіть якщо це не подобається іншим.',
    },
    {
        id: 58,
        question: 'Мені комфортно знаходитися в середовищі, де є визначені межі та правила.',
    },
    {
        id: 59,
        question: 'Я вважаю важливим мати чітке розуміння того, що від мене очікується.',
    },
    {
        id: 60,
        question: 'Я здатен легко пристосовуватися до нових умов, навіть якщо вони несподівані.',
    },
    {
        id: 61,
        question: 'Мені легше працювати, коли завдання чітко сформульоване.',
    },
    {
        id: 62,
        question: 'Я часто перевіряю свою точку зору на основі фактів.',
    },
    {
        id: 63,
        question: 'Я часто відчуваю, що мої рішення ґрунтуються на особистих переконаннях.',
    },
    {
        id: 64,
        question: 'Мені подобається, коли мої дії мають чіткі наслідки.',
    },
    {
        id: 65,
        question: 'Я відчуваю себе комфортніше, коли маю можливість самостійно організувати свою роботу.',
    },
    {
        id: 66,
        question: 'Я часто відчуваю себе напружено, якщо не знаю, як завершиться ситуація.',
    },
    {
        id: 67,
        question: 'Я відчуваю себе краще, коли все чітко заплановано.',
    },
    {
        id: 68,
        question: 'Я люблю мати можливість вибору, навіть якщо це додає складності.',
    },
    {
        id: 69,
        question: 'Я віддаю перевагу активним діям, ніж довгим роздуми.',
    },
    {
        id: 70,
        question: 'Я часто приймаю рішення на основі свого інтуїтивного відчуття.',
    },
    {
        id: 71,
        question: 'Я маю звичку розплановувати свою діяльність заздалегідь.',
    },
    {
        id: 72,
        question: 'Я прагну відшукати найкращі варіанти рішення, навіть якщо це займає багато часу.',
    },
    {
        id: 73,
        question: 'Я готовий прийняти рішення навіть у нестабільних обставинах.',
    },
    {
        id: 74,
        question: 'Я ціную стабільність і віддаю перевагу планованим ситуаціям.',
    },
    {
        id: 75,
        question: 'Я схильний довіряти своїм емоціям при прийнятті рішень.',
    },
    {
        id: 76,
        question: 'Я часто відчуваю потребу в стабільних умовах для досягнення результату.',
    },
    {
        id: 77,
        question: 'Я вважаю, що краще зробити щось, навіть якщо це не зовсім ідеально.',
    },
    {
        id: 78,
        question: 'Я намагаюсь контролювати ситуацію, щоб уникнути непередбачуваних наслідків.',
    },
    {
        id: 79,
        question: 'Я часто шукаю відповіді в своїй інтуїції або відчуттях.',
    },
    {
        id: 80,
        question: 'Я завжди намагаюся зробити свою роботу настільки ефективно, наскільки це можливо.',
    },
    {
        id: 81,
        question: 'Я віддаю перевагу чітким інструкціям для того, щоб зрозуміти, що робити.',
    },
    {
        id: 82,
        question: 'Я не можу працювати, якщо не маю чіткої мети або плану.',
    },
    {
        id: 83,
        question: 'Я ціную нові можливості, навіть якщо вони несуть ризики.',
    },
    {
        id: 84,
        question: 'Мені важко працювати в хаосі або коли все не організовано.',
    },
    {
        id: 85,
        question: 'Я люблю працювати в команді і активно взаємодіяти з іншими.',
    },
    {
        id: 86,
        question: 'Я рідко боюся змін і завжди шукаю нові шляхи для розвитку.',
    },
    {
        id: 87,
        question: 'Мене влаштовує, коли є чіткий план і все передбачено.',
    },
    {
        id: 88,
        question: 'Я відкритий до нових ідей і завжди готовий шукати нестандартні рішення.',
    },
    {
        id: 89,
        question: 'Я готовий діяти, навіть якщо я не повністю впевнений у своїх силах.',
    },
    {
        id: 90,
        question: 'Я більше довіряю обґрунтованим фактам, ніж абстрактним теоріям.',
    },
];
