"use strict";
Object.defineProperty(exports, "__esModule", { value: true });
exports.ISTJ = void 0;
exports.ISTJ = {
    type: 'ISTJ',
    deviz: 'Якщо щось робити, то робити це правильно',
    koronnaFraza: 'Я не говорю багато про свої досягнення. Я просто роблю те, що потрібно, на найвищому рівні.',
    tvoyaSyla: [
        'Стабільність: На мене завжди можна покластися. Якщо я взявся за справу, результат гарантовано.',
        'Професіоналізм: Я не просто виконую завдання – я роблю це краще за всіх, інакше навіть не починаю.',
        'Порядок і система: Я бачу хаос і чітко розумію, як його виправити, навіть якщо інші цього не помічають.',
        'Логіка і структурність: Я довіряю лише фактам, приймаю виважені рішення і не даю емоціям впливати на результат.',
        'Відповідальність: Я не кидаю розпочате і ніколи не шукаю відмовок чи виправдань.',
    ],
    tvoyaTayemnytsya: [
        'Я можу бути надто жорстким і негнучким, іноді втрачаючи можливості.',
        'Я часто надто сильно тримаюся правил, навіть коли бачу, що їх можна порушити задля кращого результату.',
        'Я не люблю змін, хоча іноді саме зміни можуть покращити моє життя.',
        'Я беру на себе забагато, бо не завжди довіряю іншим.',
        'Я не помічаю, коли моя сувора логіка може відштовхнути оточуючих.',
    ],
    shchoBudeYakshchoNeZminyuvaty: 'Якщо ти не навчишся хоч трохи гнучкості й надалі триматимешся лише встановлених правил, одного разу можеш зіткнутись із тим, що життя змінилося, а ти не встиг за ним. Це призведе до втрати можливостей, які справді могли зробити тебе щасливим.',
    yakUseZminytsyaKolyZrozumishSebe: 'Коли ти, ISTJ, по-справжньому зрозумієш себе, ти усвідомиш, що стабільність має слугувати тобі, а не ти стабільності. Ти перестанеш жити за принципом "так треба", бо побачиш, що іноді те, як має бути, не відповідає тому, що тобі справді потрібно. Твоя відповідальність перестане бути лише обов’язком — вона стане твоїм правом вирішувати, що справді варте твоєї енергії.',
    temnyyBlyznyuk: {
        nazva: 'Бездушний Виконавець',
        osoblyvosti: [
            'Правила є для того, щоб їх виконувати. Емоції тут ні до чого.',
            'Відмовляється визнавати важливість почуттів і зосереджується виключно на формальних вимогах.',
            'Втрачає можливості, боячись експериментувати і виходити за межі звичного.',
            'Вважає гнучкість слабкістю.',
            'Завжди виконує роботу ідеально, але іноді забуває запитати себе: «Чи це взагалі потрібно?»',
        ],
    },
    legendarnyyMoment: 'Всі панікують, завдання йде не за планом. Я мовчки беру ситуацію під контроль. Без зайвих слів, емоцій і суперечок – просто роблю все правильно й ідеально. Коли мене питають, як це вдалося, я просто відповідаю: «Я зробив так, як потрібно.»',
    offer: {
        resume: [
            'Ти не шукаєш хаосу. Ти цінуєш порядок, структуру і ясність.',
            'Ти звик робити все правильно, доводити справи до кінця і покладатися на факти, а не на порожні обіцянки.',
        ],
        keyQuestions: [
            'Але що, якщо можна діяти ще ефективніше?',
            'Що, якщо замість того, щоб покладатися тільки на досвід і логіку, ти зможеш також краще розуміти людей і себе?',
            'Ти вже маєш сильний фундамент, але його можна зміцнити.',
            'Ти можеш отримувати не тільки правильний результат, а й процес, який не виснажує, а працює на тебе.',
        ],
        title: 'Записуйся на консультацію, якщо ти хочеш:',
        benefits: [
            'Оптимізувати власні підходи до прийняття рішень і взаємодії з людьми.',
            'Побудувати систему, яка працює не тільки в теорії, а й у реальному житті.',
            'Позбутися зайвих емоційних бар’єрів у спілкуванні, не втрачаючи власної логіки і раціональності.',
        ],
        subtitle: 'Рішення просте: або ти залишаєш все, як є, або робиш наступний крок до ще більшої впевненості в собі і своїх діях.Якщо ти готовий зробити цей крок – напиши в дірект «структура і стабільність».',
    },
};
