"use strict";
Object.defineProperty(exports, "__esModule", { value: true });
exports.INFJ = void 0;
exports.INFJ = {
    type: 'INFJ',
    deviz: 'Я бачу, ким ти можеш стати',
    koronnaFraza: 'Ти думаєш, я просто мовчу? Насправді я бачу більше, ніж здається.',
    tvoyaSyla: [
        'Глибоке розуміння людей: Я бачу їхню справжню сутність, часто глибше, ніж вони самі це усвідомлюють.',
        'Візіонер: Я живу не лише сьогоднішнім днем, а й будую майбутнє, відчуваючи його задовго до інших.',
        'Моральний компас: Я завжди знаю, де правильно, а де ні. Мій внутрішній голос – сильний і чіткий орієнтир у світі сумнівів.',
        'Емоційний провідник: Я не просто розумію, я здатен допомогти іншим знайти свій внутрішній шлях',
        'Сила тиші: Моя спокійна присутність здатна змінювати атмосферу і створювати простір для справжнього розуміння.',
    ],
    tvoyaTayemnytsya: [
        'Ти часто почуваєшся чужим, навіть серед близьких людей.',
        'Іноді ти більше думаєш про інших, ніж про себе, жертвуючи власними потребами.',
        'Ти чекаєш ідеального моменту для дій, але боїшся, що він ніколи не настане.',
        'Хочеш глибоких стосунків, але боїшся відкритися до кінця і бути пораненим.',
        'Прагнеш змінювати світ, але можеш вигорати, коли відчуваєш, що тебе не чують.',
    ],
    shchoBudeYakshchoNeZminyuvaty: 'Ти ризикуєш повністю виснажитися емоційно, втратити віру в розуміння та підтримку.',
    yakUseZminytsyaKolyZrozumishSebe: 'Ти усвідомиш, що твоя глибина – це сила, і не всіх потрібно рятувати. Ти навчишся знаходити гармонійні зв’язки.',
    temnyyBlyznyuk: {
        nazva: 'Тіньовий Маніпулятор',
        osoblyvosti: [
            'Непомітно впливає на інших',
            'Віддаляється від світу',
            'Глибоко занурюється у власні ідеї',
            'Чекає, коли інші самі зрозуміють',
        ],
    },
    legendarnyyMoment: 'Ти кажеш одну-єдину фразу, яка змінює все.',
    prohrivNaZapys: [
        'Глибше зрозуміти себе та свою внутрішню місію.',
        'Навчитися зберігати енергію.',
        'Побудувати життя, у якому твоя чутливість стане силою.',
    ],
    offer: {
        title: 'Записуйся на консультацію, якщо ти хочеш:',
        benefits: [
            'Глибше зрозуміти себе та свою внутрішню місію.',
            'Навчитися зберігати енергію та не витрачати її на людей, які не готові до справжнього зв’язку.',
            'Побудувати життя, у якому твоя чутливість стане силою, а не джерелом виснаження.',
        ],
        subtitle: 'Ти звик більше давати, ніж отримувати. Але настав час зрозуміти, що й тобі є місце, де тебе можуть зрозуміти та підтримати.Якщо ти готовий знайти цей баланс – напиши в дірект «знайти свій шлях».',
    },
};
