"use strict";
Object.defineProperty(exports, "__esModule", { value: true });
exports.ENFP = void 0;
exports.ENFP = {
    type: 'ENFP',
    deviz: 'Світ величезний, і я хочу його весь!',
    koronnaFraza: 'А що, якщо саме сьогодні ти знайдеш відповідь на головне питання життя? Або зрозумієш, що тобі справді потрібно, щоб відчути щастя? Світ величезний, повний пригод, можливостей та незвіданих емоцій. І ти вже зараз можеш все це відчути!',
    tvoyaSyla: [
        'Світ для тебе – нескінченне поле для експериментів. Поки інші сумніваються, ти вже пірнаєш у новий досвід і легко захоплюєш інших своєю енергією.',
        "Ти відчуваєш можливості там, де інші бачать стіни. Інтуїція веде тебе вперед, допомагаючи помічати приховані смисли і зв'язки.",
        'Поруч із тобою люди розкриваються, стають сміливішими, яскравішими, вільнішими. Ти даруєш відчуття, що все можливо.',
    ],
    tvoyaTayemnytsya: [
        'Ти часто сумніваєшся, що дійсно знаєш, чого хочеш. Це може перетворюватись на постійне перемикання між бажаннями і страхом зробити неправильний вибір.',
        'Ти не завжди розумієш, чого справді хочеш, адже твоя увага розсіюється між багатьма захопленнями. Це втомлює і змушує сумніватися у власній глибині.',
        'Твоя легкість – лише зовнішній шар. Під нею ховається глибокий пошук автентичності, сенсів і справжнього життя.',
    ],
    shchoBudeYakshchoNeZminyuvaty: 'Якщо ти продовжиш стрибати від ідеї до ідеї, не розуміючи, чого справді прагнеш, одного дня можеш прокинутись із відчуттям, що життя промайнуло повз тебе. Яскраві емоції не замінять почуття глибокого сенсу, якого ти так прагнеш. Щоб цього уникнути, тобі важливо чітко зрозуміти, що саме робить тебе щасливим.',
    yakUseZminytsyaKolyZrozumishSebe: 'Коли ти, ENTP, по-справжньому зрозумієш себе, ти усвідомиш, що сила не в тому, щоб бачити всі можливості, а в тому, щоб пройти хоча б один шлях до кінця. Твоє геніальне мислення завжди генерувало варіанти, підкидало нові ідеї, розширювало горизонти, але ти зрозумієш, що цього недостатньо. Не достатньо просто бачити більше за інших — важливо зробити так, щоб твоя ідея пережила сам процес її народження. І тоді ти більше не будеш лише тим, хто створює хаос — ти станеш тим, хто керує ним. Ти більше не боятимешся структури, бо зрозумієш, що системність не обмежує свободу, а дає їй силу. І тоді твій хаос стане управляємою стихією, яка змінює не тільки тебе, а й світ навколо. ',
    temnyyBlyznyuk: {
        nazva: 'Неспокійний Мандрівник',
        osoblyvosti: [
            'Ти любиш починати, але тобі важко довести справу до кінця, бо поруч завжди є щось нове і цікаве.',
            'Ти шукаєш нові сенси, але часом боїшся зупинитися і зрозуміти, що шукаєш насправді.',
            'Тебе лякає рутина, передбачуваність та можливість залишитися в пастці буденності.',
        ],
    },
    legendarnyyMoment: 'Ти входиш у новий колектив, і вже через кілька хвилин усі сміються, говорять і відчувають натхнення. Ти з легкістю перетворюєш сірість на свято. Проте після цього ти часто відчуваєш глибоку тугу: чи справді тут твоє місце? Чи не загубиш ти справжнього себе серед яскравих моментів?',
    offer: {
        resume: [
            'Уяви, що вже завтра ти прокинешся з чітким розумінням себе.',
            'Ти знаєш, куди рухатись, щоб відчувати драйв і свободу.',
            'Ти легко фокусуєшся на тому, що дійсно варте твоєї енергії.',
            'Ти не зобов’язаний самотужки розбиратись у всьому. Я допоможу зібрати всі пазли в єдину картину.',
        ],
        keyQuestions: [
            'Що, якщо цей момент змінить усе?',
            'Ти відчуваєш, що всередині тебе є щось більше – мільйон ідей, натхнення, бажання жити на повну. Але як зробити так, щоб ця енергія не розчинялася в хаосі можливостей?',
        ],
        title: 'Записуйся на консультацію, якщо ти хочеш:',
        benefits: [
            'Навчитися не просто генерувати ідеї, а й реалізовувати їх на рівні стратегій.',
            'Переконувати так, щоб люди не тільки слухали, а й діяли.',
            'Використовувати свою гнучкість і швидкість мислення для реальних досягнень, а не просто цікавих суперечок.',
        ],
        subtitle: 'Жодних нудних схем – тільки практичні рішення, які працюють.Якщо ти хочеш грати на рівень вище – напиши в дірект «перевести гру на новий рівень».',
    },
};
