"use strict";
Object.defineProperty(exports, "__esModule", { value: true });
exports.INFJ = void 0;
exports.INFJ = {
    type: 'INFJ',
    deviz: 'Я бачу, ким ти можеш стати',
    koronnaFraza: 'Ти думаєш, я просто мовчу? Насправді я бачу більше, ніж здається.',
    tvoyaSyla: [
        'Глибоке розуміння людей: Я бачу їхню справжню сутність, часто глибше, ніж вони самі це усвідомлюють.',
        'Візіонер: Я живу не лише сьогоднішнім днем, а й будую майбутнє, відчуваючи його задовго до інших.',
        'Моральний компас: Я завжди знаю, де правильно, а де ні. Мій внутрішній голос – сильний і чіткий орієнтир у світі сумнівів.',
        'Емоційний провідник: Я не просто розумію, я здатен допомогти іншим знайти свій внутрішній шлях',
        'Сила тиші: Моя спокійна присутність здатна змінювати атмосферу і створювати простір для справжнього розуміння.',
    ],
    tvoyaTayemnytsya: [
        'Ти часто почуваєшся чужим, навіть серед близьких людей.',
        'Іноді ти більше думаєш про інших, ніж про себе, жертвуючи власними потребами.',
        'Ти чекаєш ідеального моменту для дій, але боїшся, що він ніколи не настане.',
        'Хочеш глибоких стосунків, але боїшся відкритися до кінця і бути пораненим.',
        'Прагнеш змінювати світ, але можеш вигорати, коли відчуваєш, що тебе не чують.',
    ],
    shchoBudeYakshchoNeZminyuvaty: 'Якщо ти продовжуватимеш приховувати справжні почуття і намагатимешся врятувати всіх, крім себе, то одного дня ризикуєш повністю виснажитися емоційно. Твій внутрішній світ стане важким і самотнім, а ти втратиш віру в те, що хтось справді може зрозуміти й підтримати тебе так, як ти підтримуєш інших',
    yakUseZminytsyaKolyZrozumishSebe: 'Коли ти, ENFJ, по-справжньому зрозумієш себе, ти усвідомиш, що ти не зобов’язаний рятувати всіх, щоб бути цінним. Твоя Fe (екстравертна чуттєвість) завжди глибоко відчувала емоції інших, бачила їхні потреби, розуміло, що їм потрібно навіть краще, ніж вони самі. Ти звик бути тим, хто надихає, підтримує, веде вперед, допомагає людям ставати кращими. Але в якийсь момент ти зрозумієш: "Я можу бути підтримкою, але я не відповідальний за шлях інших людей". Ти більше не будеш жертвувати собою заради гармонії, бо усвідомиш, що справжні стосунки будуються не лише на віддачі, а й на взаємності. Ти перестанеш намагатися витягнути кожного, бо зрозумієш, що справжнє лідерство – це не нести людей на собі, а бути поруч із тими, хто готовий іти сам. І тоді твоя здатність надихати перестане бути тягарем — вона стане даром, який ти даєш не всім, а тим, хто дійсно готовий його прийняти. ',
    temnyyBlyznyuk: {
        nazva: 'Тіньовий Маніпулятор',
        osoblyvosti: [
            'Непомітно впливає на інших, тонко використовуючи їхні слабкості.',
            'Віддаляється від світу, бо впевнений, що ніхто не здатен його зрозуміти.',
            'Глибоко занурюється у власні ідеї, іноді відриваючись від реальності.',
            'Чекає, коли інші самі зрозуміють, замість того, щоб відкрито сказати їм правду.',
        ],
    },
    legendarnyyMoment: '«Хтось переживає кризу. Всі навколо говорять щось поверхневе. Ти ж мовчки слухаєш, спостерігаєш, відчуваєш – і потім кажеш одну-єдину фразу, яка змінює все. Людина дивиться на тебе і розуміє, що ти побачив щось таке, чого не побачив ніхто інший.»',
    offer: {
        resume: [
            'Ти бачиш світ глибше, ніж інші.',
            'Ти відчуваєш людей, навіть коли вони самі не розуміють себе.',
            'Ти розумієш, що все має свій сенс, але іноді тобі здається, що твоє місце у цьому світі ще не до кінця знайдене.',
        ],
        keyQuestions: [
            'Уяви, що ти не просто розумієш інших, а ще й точно знаєш, як будувати стосунки, які не виснажують, а наповнюють.',
            'Що ти не витрачаєш енергію на тих, хто не здатен тебе зрозуміти, а знаходиш людей, з якими взаємодія приносить справжню гармонію.',
        ],
        title: 'Записуйся на консультацію, якщо ти хочеш:',
        benefits: [
            'Глибше зрозуміти себе та свою внутрішню місію.',
            'Навчитися зберігати енергію та не витрачати її на людей, які не готові до справжнього зв’язку.',
            'Побудувати життя, у якому твоя чутливість стане силою, а не джерелом виснаження.',
        ],
        subtitle: 'Ти звик більше давати, ніж отримувати. Але настав час зрозуміти, що й тобі є місце, де тебе можуть зрозуміти та підтримати.Якщо ти готовий знайти цей баланс – напиши в дірект «знайти свій шлях».',
    },
};
