"use strict";
Object.defineProperty(exports, "__esModule", { value: true });
exports.INFP = void 0;
exports.INFP = {
    type: 'INFP',
    deviz: 'Я тут, щоб відчувати світ по-справжньому',
    koronnaFraza: 'Для мене життя – це пошук автентичності. Я відчуваю глибше, бачу тонше і завжди шукаю щось більше, ніж просто поверхню.',
    tvoyaSyla: [
        'Глибина сприйняття: я бачу красу й сенс там, де інші помічають лише буденність.',
        'Непохитна вірність своїм цінностям: мене неможливо купити чи змусити зрадити свої принципи заради чужого схвалення.',
        'Творча душа: я не просто існую, я створюю. Мої думки і почуття формують нові світи, що захоплюють і надихають інших.',
        'Емоційна інтуїція: я не просто відчуваю, що відбувається з людьми, – я бачу їхню справжню сутність, часто навіть глибше за них самих.',
        'Ідеалістичність: я мрію про світ, де все справжнє, глибоке і чесне. І не просто мрію – я прагну зробити його таким.',
    ],
    tvoyaTayemnytsya: [
        'Ти переживаєш усе сильніше за інших, і це може виснажувати тебе.',
        'Часто шукаєш гармонію навколо, забуваючи про власні потреби та бажання.',
        "Іноді боїшся діяти, очікуючи на 'ідеальний момент', який може так і не настати.",
        'Прагнеш глибоких зв’язків, але боїшся, що люди не зрозуміють твоєї справжньої сутності.',
        'Можеш загубитися між реальністю й своїми мріями, переживаючи, що життя розіб’є твої ідеали.',
    ],
    shchoBudeYakshchoNeZminyuvaty: 'Якщо ти й надалі уникаєш реальності та відмовляєшся діяти через страх неідеальності світу, твоя мрійливість може обернутися глибоким розчаруванням у житті. Є ризик, що ти так і не відчуєш себе по-справжньому реалізованим, бо не наважився перетворити свої мрії на реальні справи.',
    yakUseZminytsyaKolyZrozumishSebe: 'Коли ти, INFP, по-справжньому зрозумієш себе, ти усвідомиш, що світ не зміниться сам — або ти почнеш втілювати свої ідеї в життя, або вони залишаться лише мріями. Твоє інтровертне відчуття завжди шукало істину всередині, створювало ідеальний світ, у якому все має глибокий сенс і гармонію. Але ти зрозумієш, що цей світ існує не для того, щоб бути лише у твоїй голові, а для того, щоб ти навчився приносити .його в реальність. Ти більше не будеш чекати, що хтось випадково зрозуміє тебе повністю, бо усвідомиш: світ може відчути твою суть тільки тоді, коли ти сам почнеш показувати її через свої дії. І тоді твоя ідеальність перестане бути просто фантазією — вона стане тим, що ти втілюєш, змінюючи реальність навколо себе ',
    temnyyBlyznyuk: {
        nazva: 'Загублений Мрійник',
        osoblyvosti: [
            'Ховається від реальності у внутрішньому світі фантазій, відмовляючись діяти.',
            'Втрачає себе в нескінченних пошуках сенсу, не наважуючись зробити вибір.',
            'Боїться відкриватися людям, аби не порушити свій внутрішній комфорт.',
            "Втрачає зв'язок із реальністю, занурюючись у власний світ, де безпечно, але самотньо.",
        ],
    },
    legendarnyyMoment: 'Всі сперечаються про проблему. Ти мовчки спостерігаєш, аналізуєш ситуацію і в потрібний момент кажеш щось таке глибоке й справжнє, що змінює перспективу інших назавжди. Люди дивляться на тебе і відчувають, що ти побачив щось більше.',
    offer: {
        resume: [
            'Ти тут, щоб відчувати світ глибоко.',
            'Ти завжди шукаєш сенс у людях, подіях, емоціях.',
            'Але що, якщо настав час не тільки шукати, а й знаходити?',
        ],
        keyQuestions: [
            'Уяви, що ти не просто живеш у мріях, а реалізовуєш їх так, щоб вони приносили справжнє задоволення.',
            'Що твоя чутливість стає твоєю силою, а не слабкістю. Що ти більше не вагаєшся між «а що, якщо?» і «а раптом…», а точно знаєш, що саме наповнює твоє життя справжнім зміс',
        ],
        title: 'Записуйся на консультацію, якщо ти хочеш:',
        benefits: [
            'Навчитися розпізнавати свої справжні бажання, а не загублюватися серед очікувань інших.',
            'Знайти баланс між мріями та реальністю, щоб жити в гармонії, а не у вічному пошуку.',
            'Побудувати стосунки та життя, які відповідають твоїм глибоким цінностям.',
        ],
        subtitle: 'Ти відчуваєш цей світ тонше, ніж інші. Але настав час зробити так, щоб це відчуття працювало на тебе. Якщо ти готовий знайти свій істинний шлях – напиши в дірект «знайти свою справжність».',
    },
};
