"use strict";
Object.defineProperty(exports, "__esModule", { value: true });
exports.ESFJ = void 0;
exports.ESFJ = {
    type: 'ESFJ',
    deviz: 'Я подбаю про тебе',
    koronnaFraza: '«Як ти почуваєшся? У тебе все добре? Ти нічого не потребуєш?»',
    tvoyaSyla: [
        'Турбота і увага: Ти завжди знаєш, хто чого потребує. Ти вмієш створювати тепло, затишок і комфорт навіть у складних ситуаціях.',
        'Організатор комфорту: Ти інтуїтивно створюєш порядок навколо себе, де кожен відчуває себе важливим і захищеним.',
        'Майстер соціальної гармонії: Ти будуєш дружні, міцні стосунки, легко налагоджуєш контакти і знаєш, як підтримати атмосферу доброзичливості в будь-якій групі.',
        'Емоційна підтримка: Люди звертаються до тебе за порадою та підтримкою, бо знають, що ти їх почуєш і зрозумієш.',
        'Людина-свято: Твоя присутність робить будь-яке місце приємнішим, яскравішим і теплішим.',
    ],
    tvoyaTayemnytsya: [
        'Ти занадто залежиш від думки та оцінки інших, через що можеш втрачати впевненість у собі.',
        'Іноді ти жертвуєш власними інтересами і комфортом, щоб догодити всім навколо.',
        'Тобі важко, коли інші не цінують твоїх зусиль так, як ти цього очікуєш.',
        'Ти боїшся, що якщо не будеш завжди підтримувати і допомагати, тебе не любитимуть і не цінуватимуть.',
        'Ти можеш втрачати себе, ставлячи чужі потреби і бажання вище власних.',
    ],
    shchoBudeYakshchoNeZminyuvaty: 'Якщо ти продовжиш чекати схвалення від усіх навколо, забуваючи про власні потреби, то одного дня можеш зрозуміти, що твоє життя побудоване на чужих бажаннях, а не на твоїх власних. І ця думка може глибоко засмутити тебе, навіть якщо зовні все виглядатиме ідеально.',
    yakUseZminytsyaKolyZrozumishSebe: 'Коли ти, ESFJ, по-справжньому зрозумієш себе, ти усвідомиш, що твоя цінність не визначається тим, наскільки ти корисний для інших. Ти більше не будеш намагатися заслужити любов через турботу, бо усвідомиш, що справжнє прийняття або є, або його немає. Ти перестанеш утримувати зв’язки, які існують лише завдяки твоїм зусиллям, бо зрозумієш: справжні стосунки – це не лише твоя турбота про інших, а й їхня турбота про тебе. І тоді твоя доброта перестане бути обов’язком — вона стане даром, який ти роздаєш не з порожнього місця, а з наповненого серця.',
    temnyyBlyznyuk: {
        nazva: 'Мученик Гармонії',
        osoblyvosti: [
            'Потребує постійного визнання і вдячності за свою турботу.',
            'Використовує свою доброту та турботу як спосіб контролювати і керувати людьми.',
            'Часто втомлюється, бо не дозволяє собі сказати «ні».',
            'Ображається, якщо люди не відповідають так, як він очікує.',
        ],
    },
    legendarnyyMoment: '«Хтось почувається самотньо або незручно у великій групі. Ти першим помічаєш цю людину, підходиш і робиш так, що вона миттєво відчуває себе цінною, важливою та прийнятою.»',
    offer: {
        resume: [
            'Ти завжди знаєш, як створити комфортну атмосферу, підтримати близьких і зробити так, щоб усім було добре.',
            'Тобі важливо, щоб у стосунках була довіра, турбота і взаємна підтримка.',
        ],
        keyQuestions: [
            'Що, якщо тобі теж потрібна людина, яка зрозуміє тебе, почує і допоможе знайти баланс?',
            'Але що, якщо ти витрачаєш всю енергію на інших і забуваєш про себе?',
            'Уяви, що ти можеш продовжувати піклуватися про людей, але без виснаження. Що твої стосунки наповнюють тебе, а не забирають сили. Що поруч є ті, хто цінує тебе так само, як ти цінуєш інших',
        ],
        title: 'Записуйся на консультацію, якщо ти хочеш:',
        benefits: [
            'Навчитися будувати стосунки, у яких ти отримуєш стільки ж тепла, скільки даєш.',
            'Позбутися відчуття, що тебе недооцінюють, і знайти людей, які по-справжньому цінують твою турботу.',
            'Зрозуміти, як зберігати гармонію, не жертвуючи собою.',
        ],
        subtitle: 'Ти завжди піклуєшся про інших, але зараз час подбати про себе. Напиши в дірект «хочу гармонію» – і ми знайдемо шлях до стосунків, у яких ти відчуватимеш справжню взаємність.',
    },
};
