"use strict";
Object.defineProperty(exports, "__esModule", { value: true });
exports.ISTP = void 0;
exports.ISTP = {
    type: 'ISTP',
    deviz: 'Я розберусь, як це працює',
    koronnaFraza: 'Не розказуй мені, як це працює. Просто дай мені це в руки – я розберусь сам.',
    tvoyaSyla: [
        'Практична логіка: Ти вмієш швидко зрозуміти, як усе працює, без зайвих пояснень та інструкцій. Ти просто береш і робиш.',
        'Спокій у кризових ситуаціях: Коли інші губляться чи панікують, ти миттєво знаходиш рішення, зберігаючи спокій та холодний розум.',
        'Незалежність і свобода: Ти не терпиш контролю і завжди знаєш, як уникнути зайвих обмежень. Твоя свобода – це твоє джерело сили.',
        'Майстерність і майстерність рук: Ти легко можеш розібрати й полагодити те, перед чим інші здаються безсилими.',
        'Гнучкість і адаптивність: Ти швидко реагуєш на зміни і здатен знайти вихід із будь-якої ситуації.',
    ],
    tvoyaTayemnytsya: [
        'Тобі складно висловлювати свої почуття, навіть коли тобі не байдуже.',
        'Ти уникаєш пояснень, тому що не любиш, коли тебе змушують обговорювати очевидні речі.',
        'Ти можеш здатися холодним і байдужим, хоча насправді це не так.',
        'Тобі важко втримувати глибокі емоційні стосунки, бо вони вимагають зусиль, які здаються тобі зайвими.',
        'Ти іноді губиш можливості через свою звичку уникати відповідальності.',
    ],
    shchoBudeYakshchoNeZminyuvaty: 'Якщо ти й надалі уникаєш емоційної близькості й важливих рішень, то в певний момент можеш усвідомити, що поруч немає нікого, хто б справді знав і розумів тебе. І твоя незалежність може перетворитися на небажану самотність.',
    yakUseZminytsyaKolyZrozumishSebe: 'Коли ти, ISTP, по-справжньому зрозумієш себе, ти усвідомиш, що справжня свобода — це не просто уникнення зобов’язань, а здатність вибирати те, що дійсно має значення. Ти більше не будеш жити лише в реакції на обставини, бо усвідомиш, що незалежність — це не про втечу, а про вміння зануритися у щось важливе без страху втратити себе. Ти перестанеш уникати глибоких зв’язків і довготривалих рішень, бо відчуєш, що контроль над своїм життям приходить не від дистанції, а від свідомого вибору.',
    temnyyBlyznyuk: {
        nazva: 'Незалежний Цинік',
        osoblyvosti: [
            'Відмовляється розуміти почуття інших людей, вважаючи це зайвою морокою.',
            'Втрачає глибокі зв’язки, тому що не хоче докладати емоційних зусиль.',
            "Уникає відповідальності та зобов'язань, бо боїться втратити власну свободу.",
        ],
    },
    legendarnyyMoment: '«Усі панікують через поломку або несправність. Ти мовчки, спокійно береш потрібні інструменти, за кілька хвилин виправляєш проблему і спокійно повертаєшся до своїх справ, поки інші ще сперечаються, як це взагалі сталося.»',
    offer: {
        keyQuestions: [
            'Але що, якщо можна не просто орієнтуватися в ситуаціях, а й контролювати їх?',
            'Що, якщо твої навички аналізу та швидких рішень можуть допомогти тобі не тільки уникати проблем, а й створювати переваги?',
        ],
        resume: [
            'Ти не витрачаєш час на порожні розмови. Тобі важливо бачити конкретні рішення, які працюють тут і зараз.',
            'Ти не любиш зайвих емоцій, складних пояснень і неефективних систем.',
        ],
        title: 'Записуйся на консультацію, якщо ти хочеш:',
        benefits: [
            'Приймати рішення швидше та впевненіше, не сумніваючись у результаті.',
            'Навчитися вибудовувати стосунки, у яких немає зайвих емоційних вимог.',
            'Використовувати свою логіку та практичне мислення для особистого зростання та досягнень.',
        ],
        subtitle: 'Жодних зайвих слів. Тільки конкретні інструменти, які працюють. Якщо ти хочеш більше контролю над своїм життям – напиши в дірект «чіткий план».',
    },
};
